{
    "(optional) Paste metadata here.": "(optionnel) Coller les métadonnées ici.",
    "Column":"Colonne",
    "Column properties":"Propriétés de la colonne",
    "Columns":"Colonnes",
    "Copy":"Copier",
    "Copy metadata to the clipboard.":"Copier les métadonnées dans le presse-papier.",
    "Copy properties to the clipboard.":"Copier les propriétés dans le presse-papier.",
    "Data has been copied into the clipboard.": "Les données ont été copiées dans le presse-papier.",
    "Data to paste": "Données à coller",
    "Description":"Description",
    "Formula":"Formule",
    "If checked, copy the column metadata.":"Si coché, les métadonnées de cette colonne seront copiées.",
    "If checked, copy the property.":"Si coché, la propriété sera copiée.",
    "Is formula":"Est une formule",
    "That being said, precautions have been taken on the widget side, but it is always strongly recommended to use the Work on a copy feature provided by Grist, and then, if everything went well, apply the changes to the main document.":
      "Cela étant dit, des précautions ont été prises côté widget, mais il est toujours fortement recommandé d'utiliser la fonction *Travailler sur une copie* fournie par Grist, puis si tout s'est bien passé, appliquer les modifications au document principal.",
    "Label":"Label",
    "No data present in the clipboard.": "Aucune donnée n'est présente dans le presse-papier.",
    "No data to copy.": "Aucune donnée à copier.",
    "No data to paste.": "Aucune donnée à coller.",
    "On some browser (like Chrome), the access from the clipboard is denied, so you need to paste manually its content in the text area below (using ctrl+V) and then click on the \"Paste\" button.": 
      "Sur certain navigateurs (comme Chrome), l'accès au presse-papier est interdit, donc vous devez coller manuellement son contenu dans la zone de texte ci-dessous (avec ctrl+V), puis cliquer sur le boutont \"Coller\".",
    "Options":"Options",
    "Paste":"Coller",
    "Paste metadata from the clipboard.":"Coller les métadonnées depuis le presse-papier.",
    "Paste properties from the clipboard.":"Coller les propriétés depuis le presse-papier.",
    "Properties":"Propriétés",
    "Properties pasted successfully.": "Les propriétés ont été collées avec succès.",
    "Recalc trigger":"Déclencheur de recalcul",
    "Select all columns or nothing.":"Sélectionner toutes les colonnes ou aucune.",
    "Select all properties or nothing.":"Sélectionner toutes les propriétés ou aucune.",
    "Select which columns to copy.":"Sélectionnez quelles colonnes copier.",
    "Select which column to manage.":"Sélectionnez la colonne sur laquelle travailler.",
    "Select which properties to copy.":"Sélectionnez quelles propriétés copier.",
    "Select which table to manage.":"Sélectionnez la table sur laquelle travailler.",
    "Selection":"Sélection",
    "Structure imported successfully (be careful, new columns are hidden by default).": "Structure importée avec succès (attention, les nouvelles colonnes sont masquées par défaut).",
    "Table":"Table",
    "Table structure":"Structure de la table",
    "Target column":"Colonne cible",
    "Target table":"Table cible",
    "The data in the clipboard is not in the correct format.": "Les données dans le presse-papier ne sont pas au format attendu.",
    "The widget is therefore provided as it is, and the author cannot be held responsible for any problems that the widget may cause.":"Le widget est donc fourni tel quel, et l'auteur ne pourra être tenu responsable des problèmes que le widget pourrait engendrer.",
    "This widget affects the structure of tables, so even though it has been tested in various situations, during development, it became apparent that Grist was not sufficiently protected and that poorly formatted information could corrupt the document.":
      "Ce widget touche à la structure des tables, donc même s'il a été testé dans différentes situations, il est apparu durant le développement que Grist n'était pas suffisamment protégé, et que des informations mal formatées pouvaient corrompre le document.",
    "Type":"Type",
    "Your browser denies access to clipboard, so you need to paste manually first its content into the previous section \"Data to paste\".": 
      "Votre navigteur interdit l'accès au presse-papier, vous devez coller manuellement en premier son contenu dans la section précédente \"Données à coller\"."
  }